# coding=utf-8
import pyttsx3
import random
jg=['爱情']
s_xk=['激情','承诺','亲密']
s_rm=["莎士比亚","但丁","奥维德","朱耀燮","乔·拜伦","蒙田"]
s_mj=["“真实爱情的途径并不平坦”","“爱情使人心的憧憬升华到至善之境。”","“谁口口声声说‘我不爱’，谁就在爱。”","“男女之间真正的爱情，不是靠肉体或者精神所能实现的，只有彼此的精神和肉体相互融合的状态中才可能实现。”","“爱情中的欢乐和痛苦是交替出现的。”","“谁按规定去爱，谁就得不到爱。”"]
s_gn=["多巴胺","催产素","后叶加压素","内啡呔","皮质醇"]
s_sx=["择偶心理","初恋心理","爱情挫折心理"]
xz=["博爱"]
xk=[]
rm=[]
mj=[]
gn=[]
sx=[]
for i in range(0,3):
    xk.append(s_xk[random.randint(0,2)])

for i in range(0,6):
    j=random.randint(0,5)
    rm.append(s_rm[j])
    mj.append(s_mj[j])

for i in range(0,4):
    gn.append(s_gn[random.randint(0,4)]) 

for i in range(0,3):
    sx.append(s_sx[random.randint(0,2)])

text='生活在'+jg[0]+'上\n'+'现代'+xk[0]+'以'+rm[0]+'的'+mj[0]+'为嚆矢。滥觞于'+xk[1]+'与'+xk[2]+'的期望正失去它们的借鉴意义。但面对看似无垠的未来天空，我想循'+rm[1]+mj[1]+'好过过早地振翮。'+'我们怀揣热忱的灵魂天然被赋予对超越性的追求，不屑于古旧坐标的约束，钟情于在别处的芬芳。但当这种期望流于对'+sx[0]+'主义不假思索的批判，乃至走向'+sx[1]+'与'+sx[2]+'主义时，便值得警惕了。与秩序的落差、错位向来不能为越矩的行为张本。而纵然我们已有翔实的蓝图，仍不能自持已在浪潮之巅立下了自己的沉锚。'+mj[2]+rm[2]+'之言可谓切中了肯綮。人的'+xz[0]+'性是不可祓除的，而我们欲上青云也无时无刻不在因风借力。'+xk[2]+'与'+xk[1]+'暂且被我们把握为一个薄脊的符号客体，一定程度上是因为我们尚缺乏体验与阅历去支撑自己的认知。而这种偏见的傲慢更远在知性的傲慢之上。在孜孜矻矻以求'+xk[0]+'意义的道路上，对自己的期望本就是在与'+xk[2]+'与'+xk[1]+'对接中塑型的动态过程。而我们的底料便是对不同'+gn[0]+'、不同'+gn[1]+'的觉感与体认。'+rm[3]+'为'+rm[4]+'送去'+gn[2]+'，又维系'+gn[3]+'。他的'+xk[0]+'观念是厚实的，也是实践的。倘若我们在对过往借'+rm[5]+'之言“祓魅”后，又对不断膨胀的自我进行“赋魅”，那么在丢失外界预期的同时，未尝也不是丢了自我。'+'用在'+jg[0]+'上的生活方式体现个体的超越性，保持婞直却又不拘泥于所谓“遗世独立”的单向度形象。'+'这便是'+rm[5]+'为我们提供的理想期望范式。生活在'+jg[0]+'上——始终热爱大地——升上天空。'
f=open("满分情书.txt",'w+')
f.write(text)
f.close()

engine = pyttsx3.init()
engine.say(text)
engine.runAndWait()


    